INS='com.burbn.instagram'

INS注册开屏界面 = {
		界面特征 = {"INS注册开屏界面", 0xffffff, "21|8|0x000000,92|55|0x000000,169|44|0x000000,180|44|0xffffff,12|230|0x0098fe,130|342|0x3e9bfd,185|344|0x4998fd,54|234|0xffffff", 90, 26, 320, 741, 891}
	}
INS注册登录界面 = {
		界面特征 = {"INS注册登录界面",0x000000, "286|11|0x000000,487|187|0xfafafa,431|304|0xc7c7c7,291|391|0x4998fd,408|522|0x5acbfe,305|992|0x4998fd,256|997|0x4998fd,338|1000|0x4998fd", 90, 4, 190, 736, 1332}
	}
	
INS注册手机号注册界面 = {
		界面特征 = {"INS注册手机号注册界面",0x000000, "120|50|0x000000,425|51|0x000000,135|162|0x000000,157|203|0x000000,230|279|0xc1c1c3,516|285|0xfafafa,148|492|0x8f8f8f,357|497|0x8f8f8f", 90, 15, 50, 728, 622}
	}
INS注册手机号出错界面 = {
		界面特征 = {"INS注册手机号出错界面",0xff3350, "2|86|0xff3350,-94|118|0xff3350,-94|148|0xff3350,-37|258|0x0098fe,181|260|0xffffff", 90, 47, 293, 747, 642}
	}		
INS注册邮箱界面 = {
		界面特征 = {"INS注册邮箱界面",0x000000, "135|158|0x737373,447|160|0x000000,470|156|0x000000,489|203|0x000000,409|279|0xfafafa", 90, 12, 48, 711, 423}
	}	
INS注册验证码界面 = {
		界面特征 = {"INS注册验证码界面",0x000000, "131|3|0x000000,298|6|0x000000,470|3|0x000000,474|323|0xfafafa,481|438|0x5acbfe", 90, 29, 70, 727, 689}
	}
INS注册设置用户名界面 = {
		界面特征 = {"INS注册设置用户名界面",0x000000, "91|-6|0x000000,191|-21|0x000000,294|-2|0x000000,-93|77|0x737373,290|74|0x737373", 90, 57, 61, 669, 259}
	}	
INS注册设置密码界面 = {
		界面特征 = {"INS注册设置密码界面",0x000000, "175|4|0x000000,399|4|0x000000,437|115|0xc7c7c7", 90, 34, 61, 725, 303}
	}
	
INS注册记住登录信息界面 = {
	界面特征 = {"INS注册记住登录信息界面",0x000000, "252|8|0x000000,369|0|0x000000,238|502|0xdbdbdb,258|523|0xdbdbdb,242|614|0x252525,355|1001|0x0098fe,193|1104|0x4998fd", 90, 12, 126, 724, 1306}
}	
	
INS注册选择生日界面 = {
	界面特征 = {"INS注册选择生日界面",0x883ac6, "-208|87|0xe45c4d,-98|179|0xdbdbdb,-286|261|0x000000,-95|254|0x000000,-195|256|0x000000,9|752|0x0098fe,-157|162|0x252525", 90, 16, 52, 740, 1278}
}	

INS注册设置用户名界面 = {
	界面特征 = {"INS注册设置用户名界面",0x000000, "158|-4|0x000000,-86|79|0x737373,215|121|0x737373,326|124|0x737373", 90, 32, 66, 692, 285}
}

INS注册确定界面 = {
	界面特征 = {"INS注册确定界面",0x737373, "-119|0|0x737373,125|-4|0x737373,404|-5|0x737373,263|105|0x4998fd,8|972|0x8e8e8e,235|971|0x8e8e8e,274|1073|0x4998fd,323|1068|0x4998fd", 90, 28, 74, 728, 1310}
}

INS注册Facebook好友界面 = {
	界面特征 = {"INS注册Facebook好友界面",0x000000, "106|1|0x000000,334|-2|0x1e1e1e,191|437|0x252525,308|548|0xb93492,365|634|0xe33267,438|978|0x0098fe,235|1101|0x4998fd", 90, 20, 108, 738, 1306}
}

INS注册授权通讯录界面 = {
	界面特征 = {"INS注册授权通讯录界面",0x000000, "104|-1|0x000000,267|-7|0x000000,266|99|0x737373,53|401|0xdbdbdb,25|423|0x252525,212|552|0xb73493,280|634|0xe43465,321|1009|0x0098fe,141|1100|0x4998fd", 90, 10, 130, 734, 1312}
}


INS注册设置头像界面 = {
	界面特征 = {"INS注册设置头像界面",0x000000, "98|1|0x000000,274|-9|0x000000,-43|62|0x767676,165|358|0x252525,204|510|0x252525,212|511|0x753bb7,265|559|0xe13467,252|631|0xfed274,316|978|0x0098fe", 90, 28, 120, 736, 1308}
}


INS注册推荐好友界面 = {
	界面特征 = {"INS注册推荐好友界面",0x000000, "142|10|0x000000,414|6|0x4998fd,447|4|0x4998fd,422|98|0x0098fe,394|240|0x0098fe,-177|113|0x0079fa,443|501|0x737373", 90, 2, 47, 746, 662}
}

INS注册通知管理界面 = {
	界面特征 = {"INS注册通知管理界面",0x000000, "99|23|0x000000,328|12|0x000000,165|307|0x4f61d1,302|379|0xcb2e98,244|537|0x252525,289|1026|0x0098fe,202|1119|0x4998fd", 90, 28, 142, 726, 1314}
}

INS注册成功主界面 = {
	界面特征 = {"INS注册成功主界面",0x000000, "630|-3|0x000000,181|7|0x000000,80|181|0x0095f6,20|1192|0x000000,324|1200|0x000000,491|1202|0x000000,636|1214|0x000000,89|403|0x8e8e8e,541|409|0x8e8e8e", 90, 10, 40, 730, 1314}
	}


创建用户按钮X =  354
创建用户按钮Y =  731

NEXT按钮X = 313  
NEXT按钮Y = 490
	
清除按钮X =  629
清除按钮Y =  363

选择月={194,996,178,1252}
选择日={414,966,412,1226}
选择年={560,962,578,1236}


注册按钮X  =   490
注册按钮Y  =   1288

手机号输入框X = 347
手机号输入框Y = 359

验证码输入框X = 311
验证码输入框Y = 459

验证码下一步X = 382
验证码下一步Y = 583
		
用户名输入框X = 370
用户名输入框Y = 325
		
密码输入框X = 349
密码输入框Y = 242

注册next生日X = 442 
注册next生日Y = 862
		
Skip按钮X = 371
Skip按钮Y = 1291		
		
弹框Skip按钮X = 231	
弹框Skip按钮Y = 808
		
用户名对勾X=572     --输入用户名后是否出现绿色对勾，如果不出现就是用户名重复
用户名对勾Y=362
对勾的颜色=0x00c600 --绿色		


INS浏览器注册欢迎界面 = {
	界面特征 = {"INS浏览器注册欢迎界面",0x262626, "91|11|0x262626,-21|114|0x8e8e8e,311|114|0x8e8e8e,313|245|0x0095f6,40|341|0x0095f6,231|341|0x0095f6,145|339|0x8e8e8e,116|674|0x1c2b33", 90, 2, 146, 738, 1224}
}
INS浏览器注册欢迎界面2 = {
	界面特征 = {"INS浏览器注册欢迎界面2",0xfb145b, "24|-11|0xd515a3,584|1|0x007aff,159|415|0x262626,414|429|0x262626,140|529|0x8e8e8e,268|565|0x8e8e8e,496|653|0x0095f6,201|753|0x0095f6,289|759|0x8e8e8e,337|761|0x0095f6", 90, 0, 133, 748, 1090}
}
INS浏览器注册界面 = {
	界面特征 = {"INS浏览器注册界面",0x262626, "280|5|0x262626,11|92|0x7f7f7f,146|219|0x262626,160|262|0x262626,507|261|0xdbdbdb", 90, 5, 42, 749, 685}
}

浏览器注册按钮X = 431
浏览器注册按钮Y = 852

浏览器注册2按钮X = 422
浏览器注册2按钮Y = 854

INS浏览器选择国家地区界面 = {
    界面特征 = {"INS浏览器选择国家地区界面",0x262626, "52|-10|0xc7c7c7,522|32|0xdbdbdb,258|-10|0xc7c7c7,261|143|0xdbdbdb,283|251|0xdbdbdb,287|358|0xdbdbdb", 90, 1, 146, 740, 679}
}

-- 浏览器选择地区输入框X1 = 326
-- 浏览器选择地区输入框Y2 = 192
-- 浏览器选择地区输入框X = 201
-- 浏览器选择地区输入框Y = 263


火狐浏览器选择地区输入框X = 232
火狐浏览器选择地区输入框Y = 275

-- INS浏览器接收验证码界面 = {
--     界面特征 = {"INS浏览器接收验证码界面",0x262626, "278|2|0x262626,330|5|0x262626,363|-3|0x262626,175|109|0x262626,253|107|0x262626,155|42|0xdbdbdb,439|-1|0xffffff", 90, 22, 143, 706, 436}
-- }

INS浏览器接收验证码界面 = {
    界面特征 = {"INS浏览器接收验证码界面",0x262626, "280|2|0x262626,320|4|0x262626,176|108|0x262626,256|110|0x262626,438|110|0x262626,501|118|0x262626,590|312|0xfafafa,606|45|0xdbdbdb,575|446|0xb2dffc,313|430|0xffffff,321|100|0x262626", 90, 19, 150, 725, 733}
}

INS注册验证码界面2 = {
		界面特征 = {"INS注册验证码界面2",0x262626, "58|1|0x262626,-103|106|0x262626,-24|105|0x2d2d2d,158|107|0x262626,280|296|0xfafafa,252|435|0xb2dffc,236|1|0xffffff,-297|-1|0xffffff", 90, 3, 135, 731, 761}
	}

INS浏览器ResendSMSX =506
INS浏览器ResendSMSY =397

INS浏览器设置用户名界面 = {
    界面特征 = {"INS浏览器设置用户名界面",0x262626, "112|-105|0x262626,162|-102|0x262626,-169|-109|0x262626,204|8|0x262626,164|66|0x8e8e8e,315|66|0x8e8e8e,378|249|0x262626", 90, 1, 98, 736, 574}
}

INS浏览器设置生日界面 = {
    界面特征 = {"INS浏览器设置生日界面",0x262626, "280|5|0x262626,268|47|0xdbdbdb,303|190|0xdbdbdb,353|281|0xdbdbdb,200|435|0x0597f6,302|135|0x252525", 90, 9, 86, 738, 685}
}

INS浏览器授权facebook界面 = {
    界面特征 = {"INS浏览器授权facebook界面",0x231f20, "105|5|0x231f20,160|6|0x231f20,89|451|0x262626,-7|609|0x8e8e8e,38|611|0x8e8e8e,50|643|0x8e8e8e,47|707|0x0095f6,82|805|0x0095f6", 90, 2, 145, 732, 1034}
}
INS浏览器授权facebookt跳过X = 372
INS浏览器授权facebookt跳过Y = 983

INS浏览器确认用户名界面 = {
    界面特征 = {"INS浏览器确认用户名界面",0x262626, "281|7|0x262626,221|310|0x0095f6,401|318|0x0095f6,416|408|0x0095f6,452|510|0x262626,89|516|0x8e8e8e,187|555|0x262626", 90, 11, 146, 710, 750}
}

INS浏览器确认用户名界面2 = {
    界面特征 = {"INS浏览器确认用户名界面2",0x262626, "280|5|0x262626,330|10|0x262626,502|407|0x0095f6,219|308|0x0095f6,331|309|0x0095f6,311|398|0xffffff", 90, 18, 158, 707, 682}
}

INS浏览器确认用户名NEXTX = 424	
INS浏览器确认用户名NEXTY = 595

INS浏览器添加头像界面 = {
    界面特征 = {"INS浏览器添加头像界面",0x231f20, "57|-6|0x231f20,164|6|0x231f20,92|456|0x262626,50|550|0x262626,-18|610|0x8e8e8e,160|716|0x0095f6,87|804|0x0095f6", 90, 5, 145, 717, 1038}
}
INS浏览器添加头像跳过X = 375
INS浏览器添加头像跳过Y = 981

INS浏览器报错界面 = {
    界面特征 = {"INS浏览器报错界面",0x262626, "150|-1|0x262626,596|1|0x003569,290|188|0x000000,355|195|0x000000,53|279|0x000000,330|319|0x070707", 90, 12, 152, 730, 560}
}

INS浏览器网络报错界面 = {
    界面特征 = {"INS浏览器网络报错界面",0xed4956, "-58|79|0xed4956,-160|93|0xed4956,-43|96|0xed4956,-9|128|0xed4956,259|129|0xed4956,-85|-114|0x262626,-68|-66|0x262626,49|-251|0x262626,-232|-254|0x262626", 90, 23, 149, 734, 588}
}
INS浏览器个人主页界面 = {
	界面特征 = {"INS浏览器个人主页界面",0x262626, "12|5|0x262626,251|-3|0x231f20,346|-6|0x231f20,134|113|0x262626,197|128|0x262626,471|133|0x262626,43|1013|0x262626,657|1020|0xdbdbdb", 90, 10, 148, 718, 1236}
	}
	

google浏览器条款界面 = {
    界面特征 = {"google浏览器条款界面",0xdd5145, "-1|104|0x4a8bf4,-72|143|0x1aa05e,94|117|0xffcd43", 90, 210, 469, 552, 782}
}	

接受按钮X = 324
接受按钮Y = 1242

google浏览器同步界面 = {
    界面特征 = {"google浏览器同步界面",0x4285f4, "429|-54|0x34a751,398|-137|0xf7bb2a,373|1031|0x2c75f0,-90|1022|0x2c75f0", 90, 16, 52, 728, 1312}
}	
不同步按钮X = 132
不同步按钮Y = 1270

google浏览器主页界面 = {
    界面特征 = {"google浏览器主页界面",0x4285f4, "105|33|0xea4335,227|31|0xfbbc05,253|30|0x4285f4,328|28|0x34a853,378|24|0xea4335", 90, 128, 163, 631, 372}
}	
google浏览器ins注册首页界面 = {
    界面特征 = {"google浏览器ins注册首页界面",0x262626, "75|21|0x262626,273|13|0x262626,340|246|0x0095f6,170|334|0x0095f6,230|332|0x0095f6,176|108|0x8e8e8e,310|105|0x8e8e8e", 90, 18, 378, 697, 907}
}
google浏览器ins注册按钮X =431 
google浏览器ins注册按钮Y =851

googlenext按钮X =402
googlenext按钮Y =782

google浏览器登录界面 = {
    界面特征 = {"google浏览器登录界面",0x1a73e8, "-237|130|0x202124,-55|144|0x202124,-155|247|0x202124,-41|-121|0xaecbfa,-90|-183|0xd2e3fc", 90, 7, 53, 729, 673}
}

google浏览器登录X =373
google浏览器登录Y =1265

google浏览器定位界面 = {
    界面特征 = {"google浏览器定位界面",0x3982f8, "260|-66|0xfbbc04,226|107|0x34a853,-292|40|0xfbbc04,-321|222|0x202124,125|230|0x202124", 90, 7, 222, 749, 804}
}
google浏览器定位不允许按钮X= 374
google浏览器定位不允许按钮Y= 1283

google浏览器定位界面2 = {
    界面特征 = {"google浏览器定位界面2",0x3982f8, "159|-11|0xe8eaed,232|113|0x34a853,126|230|0x202124,-85|230|0x202124,-204|235|0x202124,-329|228|0x202124", 90, 10, 357, 733, 765}
}

google浏览器设置iphone界面 = {
    界面特征 = {"google浏览器设置iphone界面",0xdc4c40, "7|128|0x1ba15f,121|54|0xffcd43,32|52|0x4285f4,-153|346|0x202124,265|350|0x202124,262|321|0x202124", 90, 11, 119, 710, 738}
}
google浏览器设置iphone界面接受按钮X= 414
google浏览器设置iphone界面接受按钮Y= 1247


google浏览器用户名不可用界面 = {
    界面特征 = {"google浏览器用户名不可用界面",0x0d0d0d, "282|4|0x0d0d0d,153|100|0x0d0d0d,221|312|0x003456,303|415|0x262626,513|416|0xffffff,286|630|0x0095f6,332|631|0x0095f6,359|633|0x0095f6,382|633|0x0095f6", 90, 22, 151, 724, 905}
}
点击GOBACK按钮X= 368
点击GOBACK按钮Y= 819

google浏览器重新设置用户名界面 = {
    界面特征 = {"google浏览器重新设置用户名界面",0x262626, "279|0|0x262626,219|106|0x262626,606|300|0x4492d8", 90, 20, 144, 709, 663}
}
浏览器重新设置用户名界面 = {
    界面特征 = {"浏览器重新设置用户名界面",0x262626, "281|4|0x262626,331|8|0x262626,221|94|0x262626,342|98|0x262626,609|291|0x4492d8,535|441|0x0095f6", 90, 13, 49, 731, 566}
}

google浏览注册界面2 = {
    界面特征 = {"google浏览注册界面2",0x262626, "90|-6|0x262626,178|21|0x262626,366|190|0x0095f6,259|738|0x0095f6,325|743|0x0095f6", 90, 24, 156, 701, 1093}
}

注册界面2X =520
注册界面2Y =1060

google浏览注册error页面= {
    界面特征 = {"google浏览注册error页面",0x262626, "47|4|0x262626,7|54|0x8e8e8e,171|56|0x8e8e8e,-15|253|0x0095f6,30|251|0x0095f6,82|254|0x0095f6", 90, 108, 530, 642, 854}
}

google浏览注确认跳过facebook页面= {
    界面特征 = {"google浏览注确认跳过facebook页面",0x262626, "177|2|0x262626,-32|211|0x0095f6,91|207|0x0095f6,127|211|0x0095f6,191|213|0x0095f6,243|213|0x0095f6", 90, 112, 512, 621, 813}
}
确认跳过skipX = 372
确认跳过skipY = 869

火狐浏览器确认跳过facebook页面= {
    界面特征 = {"火狐浏览器确认跳过facebook页面",0x231f20, "54|-21|0x231f20,89|365|0x262626,-50|461|0x262626,106|461|0x262626,253|624|0x0095f6", 90, 16, 150, 700, 975}
}
火狐确认跳过skipX = 372
火狐确认跳过skipY = 907

火狐浏览器确认跳过头像页面= {
    界面特征 = {"火狐浏览器确认跳过头像页面",0x231f20, "56|-5|0x231f20,151|10|0x231f20,-33|477|0x262626,161|472|0x262626,195|470|0x262626,178|641|0x0095f6", 90, 10, 154, 710, 928}
}

火狐浏览器确认跳过头像页面2= {
    界面特征 = {"火狐浏览器确认跳过头像页面2",0x231f20, "54|-4|0x231f20,93|2|0x231f20,149|-1|0x231f20,180|647|0x0095f6,81|718|0x0095f6,94|460|0x262626", 90, 16, 155, 697, 950}
}

火狐浏览器INS个人主页界面 = {
	界面特征 = {"火狐浏览器INS个人主页界面",0x262626, "215|-5|0x231f20,281|-7|0x231f20,652|-11|0x262626,21|1010|0x262626,316|1016|0x262626,-36|60|0xfafafa", 90, 8, 150, 722, 1242}
}
INS界面个人主页2 = {
	界面特征 = {"INS界面个人主页2",0x262626, "10|2|0xffffff,646|-1|0x262626,648|-21|0x262626,28|999|0x262626,329|1009|0x262626,189|1018|0x262626", 90, 14, 156, 730, 1234}
	}

浏览器允许保存cookie页面= {
    界面特征 = {"浏览器允许保存cookie页面",0x595959, "63|67|0xffffff,434|83|0x262626,446|83|0x262626,458|83|0x262626,395|734|0xffffff,437|833|0x0095f6,-86|424|0x262626,41|653|0xdbdbdb", 90, 8, 152, 738, 1206}
}

允许所有X = 373
允许所有Y = 1058

浏览器允许保存cookie页面2= {
    界面特征 = {"浏览器允许保存cookie页面2",0x595959, "662|1|0x595959,603|-98|0xffffff,575|-68|0x262626,563|-68|0x262626,550|-68|0x262626,123|59|0x262626,111|59|0x262626,90|59|0x262626,78|59|0x262626,623|405|0x123353,41|418|0x123353", 90, 8, 146, 734, 1222}
}

浏览器允许保存cookie页面3= {
    界面特征 = {"浏览器允许保存cookie页面3",0x595959, "45|197|0xffffff,535|158|0x262626,548|158|0x262626,560|158|0x262626,534|183|0xffffff,626|190|0x595959,533|437|0x133667,105|470|0x133667", 90, 10, 152, 743, 1145}
}
浏览器允许保存cookie页面4= {
    界面特征 = {"浏览器允许保存cookie页面4",0x595959, "340|-9|0xffffff,79|148|0x262626,91|148|0x262626,111|148|0x262626,124|148|0x262626,552|22|0x262626,564|22|0x262626,576|22|0x262626,664|311|0x595959", 90, 2, 150, 749, 826}
}

浏览器允许保存cookie页面5= {
    界面特征 = {"浏览器允许保存cookie页面5",0x595959, "115|-23|0x262626,437|68|0x262626,261|77|0x262626,94|264|0x262626,89|389|0x262626,88|424|0xffffff,88|649|0x0095f6", 90, 9, 156, 739, 1176}
}

浏览器人机检测页面= {
    界面特征 = {"浏览器人机检测页面",0x231f20, "57|-13|0x231f20,162|2|0x231f20,66|84|0xffffff,184|663|0xf9f9f9,-163|635|0xc1c1c1,-161|686|0xc1c1c1", 90, 13, 148, 730, 1021}
}

浏览器人机检测页面2= {
    界面特征 = {"浏览器人机检测页面2",0x221f20, "53|0|0x221f20,104|22|0x221f20,160|18|0x221f20,78|76|0xffffff,144|608|0xf9f9f9,-161|591|0xffffff,-166|563|0xc1c1c1,-166|614|0xc1c1c1", 90, 14, 134, 733, 845}
}

浏览器验证码失败页面= {
    界面特征 = {"浏览器验证码失败页面",0x262626, "281|6|0x262626,177|101|0x262626,48|296|0xed4956,633|299|0xed4956,616|299|0xed4956,465|506|0xb2dffc", 90, 13, 149, 734, 766}
}

浏览器网络连接错误界面 = {
    界面特征 = {"浏览器网络连接错误界面",0xe22850, "252|80|0xeeeeee,274|79|0xffffff,297|83|0xeeeeee,644|-4|0xf0f0f4,617|143|0xffffff", 90, 8, 35, 745, 493}
}

浏览器手机号失败界面 = {
    界面特征 = {"浏览器手机号失败界面",0x262626, "281|4|0x262626,394|4|0x262626,165|137|0x262626,171|182|0x262626,174|248|0xdb555a,186|326|0xdb555a,500|182|0xdbdbdb", 90, 19, 150, 736, 707}
}

手机号出错界面= {
    界面特征 = {"手机号出错界面",0x262626, "281|6|0x262626,319|4|0x262626,148|136|0x2e2e2e,208|134|0x262626,228|249|0xed4956,261|328|0xed4956,634|289|0xed4956,504|184|0xdbdbdb,175|184|0x262626", 90, 19, 156, 716, 598}
}

浏览器ins登录界面2 = {
    界面特征 = {"浏览器ins登录界面2",0x262626, "95|3|0x262626,156|2|0x262626,256|7|0x262626,400|192|0xfafafa,400|269|0xfafafa,390|443|0xb2dffc,260|527|0x0095f6,327|533|0x0095f6", 90, 24, 157, 704, 896}
}
google浏览器添加账户界面 = {
    界面特征 = {"google浏览器添加账户界面",0x4285f4, "393|-138|0xf7bb2a,469|-89|0x34a751,433|1011|0x0075f0", 90, 14, 36, 730, 1308}
}
浏览器长名字界面 = {
    界面特征 = {"浏览器长名字界面",0x262626, "281|5|0x262626,607|367|0x0095f6,546|-126|0xf0f0f4", 90, 20, 50, 733, 656}
}

浏览器适配界面1 = {
    界面特征 = {"浏览器适配界面1",0x262626, "280|4|0x262626,330|10|0x262626,570|137|0xfafafa,565|262|0x4192ef", 90, 18, 150, 715, 530}
}
浏览器跳过手机验证 = {
    界面特征 = {"浏览器跳过手机验证",0x231f20, "93|5|0x231f20,54|-6|0x231f20,148|2|0x231f20,96|223|0x262626,133|329|0x262626,42|326|0x262626,324|526|0xfafafa,307|626|0xb2dffc", 90, 6, 148, 730, 941}
}
浏览器确认用户名3 = {
    界面特征 = {"浏览器确认用户名3",0x262626, "280|6|0x262626,135|96|0x262626,290|104|0x262626,328|46|0xdbdbdb,220|309|0x0095f6,331|310|0x0095f6,401|311|0x0095f6,532|567|0x0095f6,312|561|0xffffff", 90, 14, 154, 715, 826}
}
浏览器确认用户名4 = {
    界面特征 = {"浏览器确认用户名4",0x262626, "331|5|0x262626,364|3|0x262626,220|308|0x0095f6,283|312|0x0095f6,379|309|0x0095f6,441|310|0x0095f6,312|700|0xffffff,550|700|0x0095f6,328|649|0xffffff,511|45|0xdbdbdb", 90, 18, 153, 708, 1022}
}
浏览器确认用户名5 = {
    界面特征 = {"浏览器确认用户名5",0x262626, "280|4|0x262626,387|4|0x262626,421|47|0xdbdbdb,220|320|0x0095f6,332|319|0x0095f6,380|321|0x0095f6,443|324|0x109cf6,483|730|0x0095f6,312|725|0xffffff,352|721|0xffffff", 90, 20, 150, 721, 987}
}
浏览器确认用户名6 = {
    界面特征 = {"浏览器确认用户名6",0x262626, "281|5|0x262626,365|0|0x262626,135|104|0x262626,290|111|0x262626,242|315|0x0095f6,417|319|0x0095f6,259|833|0x0095f6,312|823|0xffffff,353|827|0xffffff", 90, 22, 148, 707, 1089}
}
浏览器确认用户名7 = {
    界面特征 = {"浏览器确认用户名7",0x262626, "281|4|0x262626,394|4|0x262626,390|44|0xdbdbdb,221|316|0x0095f6,274|314|0x0095f6,340|500|0x262626,482|810|0x0095f6,313|817|0xffffff", 90, 17, 144, 690, 1106}
}

浏览器用户被封禁 = {
    界面特征 = {"浏览器用户被封禁",0x231f20, "56|-18|0x231f20,106|-1|0x231f20,-187|180|0x000000,-120|162|0x000000,126|171|0x000000,219|175|0x000000,-197|560|0x000000,-190|720|0x000000,-176|701|0xffffff,-137|421|0xdbdbdb,-126|48|0xdbdbdb,-129|802|0xdbdbdb", 90, 2, 112, 742, 1014}
}
浏览器用户被封禁2 = {
    界面特征 = {"浏览器用户被封禁2",0x231f20, "81|5|0x231f20,134|4|0x231f20,-166|191|0x000000,-118|180|0x000000,-48|182|0x000000,13|430|0xdbdbdb,-199|572|0x000000,-198|729|0x000000,-195|812|0xdbdbdb", 90, 10, 152, 732, 1168}
}
浏览器注册出错2 = {
    界面特征 = {"浏览器注册出错2",0x595959, "-95|248|0x262626,-37|262|0x262626,66|253|0x262626,-94|546|0x0095f6,15|547|0x0095f6,30|547|0x0095f6,95|546|0x0095f6,180|218|0xffffff", 90, 6, 150, 742, 1024}
}

浏览器网络出错2 = {
    界面特征 = {"浏览器网络出错2",0xe4e4e4, "-27|-51|0xffffff,40|295|0x262626,136|291|0x262626,80|442|0x4c4c4c,186|613|0xffffff", 90, 6, 50, 743, 943}
}

APP登录账号验证界面 = {
    界面特征 = {"APP登录账号验证界面",0x010101, "13|-13|0x010101,-15|15|0x010101,223|47|0xdbdbdb,615|405|0x0095f6,598|405|0xffffff,424|1102|0x0095f6,45|1208|0x0095f6,137|1209|0x0095f6,259|1104|0xffffff", 90, 8, 38, 734, 1314}
}

APP注册登录开屏界面2 = {
    界面特征 = {"APP注册登录开屏界面2",0x000000, "87|0|0x000000,171|8|0x000000,260|7|0x000000,251|-59|0xffffff,376|218|0x4998fd,12|202|0xffffff,107|313|0x4998fd", 90, 47, 365, 709, 939}
}


APP注册登录界面3 = {
    界面特征 = {"APP注册登录界面3",0x000000, "41|0|0x000000,92|-8|0x000000,152|6|0x000000,260|10|0x000000,309|192|0x0095f6,-16|199|0x0095f6,109|309|0x0095f6,165|306|0x0095f6,137|358|0xffffff,51|-27|0xffffff", 90, 10, 314, 741, 1028}
}
APP手机号注册界面1 = {
    界面特征 = {"APP手机号注册界面1",0x000000, "134|159|0x000000,227|164|0x000000,218|164|0x000000,200|204|0x000000,445|159|0x8e8e8e,469|164|0x8e8e8e,524|163|0x8e8e8e,518|283|0xfafafa", 90, 12, 49, 687, 652}
}
APP个人主页界面界面 = {
    界面特征 = {"APP个人主页界面界面",0x000000, "99|-14|0x000000,99|0|0x000000,99|14|0x000000,-416|457|0x000000,-416|506|0x000000,-56|462|0x8e8e8e,-15|462|0x8e8e8e,96|1188|0x000000,75|1186|0xffffff,-403|216|0x0095f6", 90, 8, 40, 738, 1316}
}
APP注册确定用户名界面 = {
    界面特征 = {"APP注册确定用户名界面",0x000000, "-49|-23|0xffffff,-83|89|0x8e8e8e,476|97|0x8e8e8e,326|200|0x0095f6,73|318|0x0095f6,183|318|0x0095f6,424|1035|0x8e8e8e,217|1064|0x8e8e8e,318|1162|0x0095f6,339|1163|0x0095f6,360|1162|0x0095f6", 90, 24, 62, 726, 1312}
}
APP弹框跳过界面 = {
    界面特征 = {"APP弹框跳过界面",0x8a8a8a, "89|3|0xffffff,615|191|0x8a8a8a,526|692|0x005186,164|295|0x0095f6,190|296|0x0095f6,233|297|0xffffff,96|46|0x0a0a0a", 90, 16, 60, 748, 1320}
}
APP确认用户名界面2 = {
    界面特征 = {"APP确认用户名界面2",0x000000, "111|12|0x000000,193|17|0x000000,426|1007|0x4998fd,210|1008|0xffffff,424|1111|0x4998fd,401|1111|0x4998fd", 90, 36, 106, 714, 1304}
}
APP输入手机号界面 = {
    界面特征 = {"APP输入手机号界面",0x000000, "25|1|0x000000,128|-4|0x000000,308|3|0x000000,337|-2|0x000000,330|101|0x737373,377|108|0x737373,17|101|0x000000,66|105|0x000000,64|148|0x000000,356|359|0xb2e0ff,-116|-51|0x000000", 90, 20, 49, 699, 631}
}
APP个人主页界面界面2 = {
    界面特征 = {"APP个人主页界面界面2",0x262626, "632|-16|0x262626,638|16|0x262626,250|342|0x262626,310|344|0x262626,143|206|0x3897f0,125|429|0x262626,157|479|0x262626,54|417|0xfafafa,485|433|0x8e8e8e,529|439|0x8e8e8e,625|1196|0x262626,619|1220|0x262626,599|1203|0xfafafa", 90, 20, 50, 736, 1320}
}
浏览器确认用户名8={
	界面特征={'浏览器确认用户名8',0x262626, "280|5|0x262626,112|102|0x262626,246|104|0x262626,354|112|0x262626,220|314|0x0095f6,329|314|0x0095f6,339|495|0x262626,466|703|0x0095f6,312|707|0xffffff", 90, 8, 144, 708, 996}
}
浏览器手机号注册界面01={
	界面特征={'浏览器手机号注册界面01',0x262626, "38|-1|0x262626,58|4|0x262626,-117|213|0x262626,-108|258|0x262626,194|258|0xdbdbdb,228|212|0x262626,326|385|0xfafafa,281|597|0xb2dffc,331|1160|0x0095f6", 90, 16, 84, 716, 1316}
}
浏览器手机号注册界面02={
	界面特征={'浏览器手机号注册界面02',0x262626, "39|-1|0x262626,86|-2|0x262626,114|-1|0x262626,-133|209|0x262626,-105|234|0xffffff,-99|255|0x262626,193|255|0xdbdbdb,228|209|0x282828,282|365|0xfafafa,273|607|0xb2dffc", 90, 9, 143, 723, 851}
}
INS注册界面列表={INS注册开屏界面,INS注册手机号注册界面,INS注册手机号出错界面,INS注册邮箱界面,INS注册登录界面,
				 INS注册验证码界面,INS注册设置用户名界面,INS注册设置密码界面,INS注册记住登录信息界面,INS注册选择生日界面,
				INS注册设置用户名界面,INS注册确定界面,INS注册Facebook好友界面,INS注册授权通讯录界面,INS注册设置头像界面,INS注册推荐好友界面,
				INS注册通知管理界面,INS注册成功主界面,
                INS浏览器注册界面,INS浏览器注册欢迎界面,INS浏览器注册欢迎界面2,INS浏览器选择国家地区界面,
                INS浏览器接收验证码界面,INS浏览器设置用户名界面,INS浏览器设置生日界面,INS浏览器设置生日界面,INS浏览器授权facebook界面,INS浏览器确认用户名界面,
                INS浏览器添加头像界面,INS浏览器报错界面,INS浏览器网络报错界面,INS浏览器个人主页界面,
                google浏览器条款界面,google浏览器同步界面,google浏览器主页界面,google浏览器ins注册首页界面,google浏览器登录界面,
                google浏览器用户名不可用界面,google浏览器重新设置用户名界面,google浏览注册界面2,google浏览器定位界面,google浏览器设置iphone界面,
                google浏览注册error页面,google浏览注确认跳过facebook页面,google浏览器定位界面2,
                火狐浏览器确认跳过facebook页面,火狐浏览器INS个人主页界面,火狐浏览器设备共享页面,火狐浏览器确认跳过头像页面2,INS界面个人主页2,
                浏览器允许保存cookie页面,浏览器人机检测页面,浏览器验证码失败页面,浏览器网络连接错误界面,浏览器手机号失败界面,浏览器ins登录界面2,
                google浏览器添加账户界面,浏览器长名字界面,手机号出错界面,浏览器人机检测页面2,
                浏览器适配界面1,浏览器允许保存cookie页面2,浏览器允许保存cookie页面3,浏览器允许保存cookie页面4,浏览器允许保存cookie页面5,浏览器重新设置用户名界面,浏览器跳过手机验证,
                浏览器确认用户名3,浏览器确认用户名4,浏览器确认用户名5,浏览器确认用户名6,浏览器确认用户名7,浏览器用户被封禁,浏览器用户被封禁2,浏览器注册出错2,浏览器网络出错2,
                APP登录账号验证界面,APP注册登录开屏界面2,APP注册登录界面3,APP手机号注册界面1,APP个人主页界面界面,APP注册确定用户名界面,APP弹框跳过界面,APP确认用户名界面2,
                APP输入手机号界面,APP个人主页界面界面2,浏览器确认用户名8,浏览器手机号注册界面01,浏览器手机号注册界面02,INS注册验证码界面2
}
	
键盘坐标={{372,1278},{127,956},{378,957},{625,953},{130,1054},{377,1055},{624,1056},{131,1162},{377,1162},{623,1160}}--0~9第一个是0的坐标

-----火狐浏览器-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
火狐浏览器首次登录页面= {
    界面特征 = {"火狐浏览器首次登录页面",0xfef24e, "-298|497|0x000000,-26|509|0x000000,46|518|0x000000,158|517|0x000000,115|829|0x0060df,-62|1062|0x0060df", 90, 16, 114, 722, 1278}
}
火狐浏览器首次登录X = 367
火狐浏览器首次登录Y = 1248

火狐浏览器设备共享页面= {
    界面特征 = {"火狐浏览器设备共享页面",0xf6f6f6, "-13|270|0xf6f6f6,111|250|0x321d64,-105|96|0x4c2b9a,102|963|0x0060df", 90, 20, 144, 738, 1312}
}

火狐浏览器设备共享页面开始浏览器X = 368
火狐浏览器设备共享页面开始浏览器Y = 1292

火狐浏览器底部搜索界面 = {
     界面特征 = {"火狐浏览器底部搜索界面",0xe2e2e6, "-86|-1113|0xf9f9fb,-84|110|0x505050,43|107|0x505050,62|105|0x28282c,212|92|0x4f4f4f,212|104|0x505050,212|116|0x505151", 90, 6, 36, 728, 1314}
}
火狐浏览器底部搜索界面2 = {
     界面特征 = {"火狐浏览器底部搜索界面2",0xf9f9fb, "-303|1151|0xf0f0f4,-603|102|0x20123a,-579|104|0x20123a,-58|1227|0x2a2a2e,-57|1239|0x2a2a2e,-57|1251|0x2a2a2e,-353|1245|0x2a2a2e", 90, 10, 32, 744, 1324}
}

火狐浏览器设置内部界面 = {
     界面特征 = {"火狐浏览器设置内部界面",0x0090ed, "43|1|0x0090ed,-599|173|0xb1b1b3,-575|158|0xb1b1b3,-192|312|0xf9f9fb,-187|169|0xffffff", 90, 8, 32, 734, 719}
}

火狐浏览器设置内部界面2 = {
     界面特征 = {"火狐浏览器设置内部界面2",0x0c0c0d, "325|3|0x0090ed,388|7|0x0090ed,-241|427|0xb1b1b3,325|423|0xffffff,315|148|0xffffff", 90, 7, 41, 733, 824}
}

-- 火狐浏览器设置界面 = {
--      界面特征 = {"火狐浏览器设置界面",0xf5f5f7, "337|207|0x2a2a2e,325|676|0x2a2a2e,-5|210|0xf7f7f9", 90, 6, 36, 728, 1314}
-- }

火狐浏览器顶部设置界面 = {
     界面特征 = {"火狐浏览器顶部设置界面",0xf9f9fb, "-59|-130|0xf0f0f4,-607|-123|0x2a2a2e,-512|-138|0xea4335,-510|-107|0x34a853", 90, 3, 32, 720, 558}
}

火狐浏览器顶部设置界面2 = {
     界面特征 = {"火狐浏览器顶部设置界面2",0xf0f0f4, "231|67|0xf9f9fb,-447|1198|0x2a2a2e,19|1199|0x2a2a2e,169|1184|0x2a2a2e,169|1197|0x2a2a2e,169|1209|0x2a2a2e,169|1203|0xf9f9fb", 90, 4, 30, 744, 1322}
}

火狐浏览器界面列表={
                火狐浏览器首次登录页面,火狐浏览器设备共享页面,火狐浏览器底部搜索界面,火狐浏览器设置内部界面,火狐浏览器底部搜索界面2,
                火狐浏览器顶部设置界面,火狐浏览器设置内部界面2               
                -- ,火狐浏览器设置界面
}
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



-----设置资料--------------
INS界面个人主页 = {
	界面特征 = {"INS界面个人主页",0x000000, "94|-16|0xffffff,96|-1|0x000000,96|13|0x000000,-411|232|0x0095f6,91|354|0x000000,-419|989|0x000000,-374|1026|0x000000,91|1196|0x000000", 90, 8, 58, 738, 1332}
	}

INS界面个人主页2 = {
	界面特征 = {"INS界面个人主页2",0x262626, "10|2|0xffffff,646|-1|0x262626,648|-21|0x262626,28|999|0x262626,329|1009|0x262626,189|1018|0x262626", 90, 14, 156, 730, 1234}
	}
	
INS界面选择相片 = {
	界面特征 = {"INS界面选择相片",0x000000, "283|-9|0x000000,328|-9|0x000000,605|-10|0x4998fd,659|-11|0x4998fd,666|-7|0x4998fd,276|841|0x000000", 90, 0, 4, 740, 1302}
	}
INS界面设置资料 = {
	界面特征 = {"INS界面设置资料",0x000000, "268|4|0x000000,388|-1|0x000000,619|1|0x4998fd,674|1|0x4998fd,208|319|0x4998fd,326|327|0x4998fd,421|327|0x4998fd,8|406|0x000000,8|506|0x000000", 90, 17, 57, 728, 734}
}
INS界面弹框1 = {
	界面特征 = {"INS界面弹框1",0xf0f1f0, "46|35|0x000000,245|25|0x000000,209|78|0x000000,17|353|0x007aff,349|349|0x007aff,376|351|0x007aff", 90, 84, 453, 674, 916}
}


INS浏览器个人主页界面 = {
	界面特征 = {"INS浏览器个人主页界面",0x262626, "12|5|0x262626,251|-3|0x231f20,346|-6|0x231f20,134|113|0x262626,197|128|0x262626,471|133|0x262626,43|1013|0x262626,657|1020|0xdbdbdb", 90, 10, 148, 718, 1236}
	}
INS浏览器点击主页X = 675
INS浏览器点击主页Y = 1199

火狐浏览器INS个人主页界面 = {
	界面特征 = {"火狐浏览器INS个人主页界面",0x262626, "215|-5|0x231f20,281|-7|0x231f20,652|-11|0x262626,21|1010|0x262626,316|1016|0x262626,-36|60|0xfafafa", 90, 8, 150, 722, 1242}
}

INS浏览器我的界面 = {
	界面特征 = {"INS浏览器我的界面",0x262626, "114|122|0xdbdbdb,625|0|0x262626,62|518|0x0095f6,414|525|0x8e8e8e,636|989|0x262626,241|602|0xfafafa", 90, 14, 154, 722, 1232}
	}
INS浏览器设置资料X = 472
INS浏览器设置资料Y = 354

火狐浏览器INS我的界面 = {
	界面特征 = {"火狐浏览器INS我的界面",0x262626, "607|18|0x262626,631|24|0x262626,45|539|0x0095f6,21|538|0x0095f6,20|1018|0xffffff,21|1009|0x262626", 90, 6, 154, 742, 1230}
	}
火狐浏览器INS设置资料X = 530
火狐浏览器INS设置资料Y = 363

INS浏览器选择相册界面 = {
	界面特征 = {"INS浏览器选择相册界面",0x000000, "293|-1|0x007aff,370|2|0x007aff,-124|117|0x0c0c0c,-36|108|0x000000,389|132|0xc4c4c6", 90, 3, 50, 743, 295}
	}
INS浏览器选择全部相册X = 421
INS浏览器选择全部相册Y = 214

INS浏览器选择照片界面 = {
	界面特征 = {"INS浏览器选择照片界面",0x007aff, "34|0|0x007aff,54|0|0x007aff,306|-3|0x000000,317|1|0x000000,372|0|0x000000,393|-6|0x000000,594|-1|0x007aff,647|0|0x007aff,691|-3|0x007aff", 90, 5, 52, 723, 115}
	}
INS浏览器发布头像动态界面 = {
	界面特征 = {"INS浏览器发布头像动态界面",0x262626, "82|-1|0x262626,201|0|0x262626,-47|58|0x8e8e8e,155|92|0x8e8e8e,139|213|0x0095f6,180|213|0x0095f6,114|307|0x262626", 90, 80, 467, 669, 928}
	}

INS浏览器CancelX = 382
INS浏览器CancelY = 858

INS界面列表 = {INS界面个人主页,INS界面选择相片,INS界面设置资料,INS界面弹框1,
               INS浏览器个人主页界面,INS浏览器我的界面,INS浏览器选择照片界面,INS浏览器发布头像动态界面,
               火狐浏览器INS个人主页界面,火狐浏览器INS我的界面,INS界面个人主页2
}

----PYAPP-----
新机按钮X =652
新机按钮Y =234

确定新机X = 516
确定新机Y = 787

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

-----INS登录---

APP遮罩界面1 = {
    界面特征 = {"APP遮罩界面1",0x292929, "63|-9|0x292929,652|-12|0x292929,224|-6|0xcccccc,20|1195|0x292929,168|1201|0xcccccc,323|1204|0x292929,324|675|0x97a0a3,85|188|0x0077c4", 90, 6, 36, 726, 1320}
}


APP用户名错误界面 = {
    界面特征 = {"APP用户名错误界面",0x8a8a8a, "-21|117|0x000000,79|98|0x000000,168|122|0x000000,150|314|0xffffff,-13|357|0x000000,137|357|0x000000,75|639|0x4998fd,137|651|0x4998fd,413|617|0x28528a,-138|624|0x28528a", 90, 10, 42, 736, 1322}
}

APP用户被封禁 = {
    界面特征 = {"APP用户被封禁",0x231f20, "57|-5|0x231f20,150|4|0x231f20,-196|169|0x000000,-133|183|0x000000,97|183|0x000000,-197|568|0x000000,-193|740|0x000000,-109|1209|0x0095f6,-45|1233|0xffffff,341|1217|0x0095f6", 90, 8, 32, 736, 1328}
}

APP错误界面3 = {
    界面特征 = {"APP错误界面3",0x8a8a8a, "-33|103|0x000000,-15|121|0x000000,205|113|0x000000,223|384|0xffffff,95|426|0x000000,95|435|0x000000,95|445|0x000000,141|445|0x000000,141|431|0x000000,113|479|0xffffff,200|628|0x28528a", 90, 11, 111, 737, 881}
}

APP登录个人主页={
	界面特征={'APP登录个人主页',0x000000, "62|-4|0x000000,170|6|0x000000,440|6|0x000000,86|188|0x0095f6,22|1200|0x000000,637|1207|0xffffff,625|1186|0x000000", 90, 10, 42, 728, 1324}
}	
APP登录输入账密界面 = {
    界面特征 = {"APP登录输入账密界面",0x000000, "101|-4|0x000000,189|0|0x000000,240|-1|0x000000,360|522|0x7fcbff,-1|718|0x0098fe,357|660|0xffffff,250|985|0x0098fe,319|985|0x0098fe,346|183|0xfafafa,308|281|0xfafafa", 90, 6, 50, 736, 1316}
}
APP登录个人主页界面2 = {
    界面特征 = {"APP登录个人主页界面2",0xdbdbdb, "59|70|0x0095f6,453|39|0xffffff,627|-106|0x000000,2|1099|0x000000,-3|1122|0xffffff,35|-110|0x000000,94|-86|0x000000,155|-90|0x000000", 90, 12, 34, 738, 1322}
}
APP登录个人主页03={
	界面特征={'APP登录个人主页03',0x000000, "61|-3|0x010101,151|5|0x090909,635|2|0x060606,596|-5|0xffffff,21|1191|0x000000,21|1214|0xffffff,323|1202|0x000000,671|2|0xffffff,182|1211|0x020202,178|1206|0xffffff,178|1225|0xffffff", 90, 12, 38, 730, 1326}
}
APP登录个人主页04 = {
    界面特征 = {"APP登录个人主页04",0x000000, "-654|12|0x000000,-592|3|0x000000,-485|17|0x010101,-626|1206|0x000000,-629|1224|0xffffff,-329|1213|0x020202,-335|1219|0xffffff,-470|1223|0x020202,-480|1214|0xffffff", 90, 8, 38, 732, 1324}
}
INS登录界面列表={
    INS注册开屏界面,APP注册登录开屏界面2,APP登录账号验证界面,INS注册登录界面,APP遮罩界面1,APP用户名错误界面,APP用户被封禁,APP错误界面3,APP登录个人主页,APP注册登录界面3,APP登录输入账密界面,APP登录个人主页界面2,APP登录个人主页03,
    APP登录个人主页04
}


























